Terraform plan for role permissions in stateless module (deployment resources):
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.stateless.aws_iam_policy.fhir_parameter_store will be created
  + resource "aws_iam_policy" "fhir_parameter_store" {
      + arn         = (known after apply)
      + description = "Read-only permissions to environment scoped parameter store variables"
      + id          = (known after apply)
      + name        = "bfd-test-fhir-ro-parameter-store"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/test/shared/*",
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/test/server/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.stateless.aws_iam_role_policy_attachment.fhir_parameter_store will be created
  + resource "aws_iam_role_policy_attachment" "fhir_parameter_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bfd-test-fhir-role"
    }

  # module.stateless.module.bfd_pipeline.aws_iam_policy.parameter_store will be created
  + resource "aws_iam_policy" "parameter_store" {
      + arn         = (known after apply)
      + description = "Read-only permissions to environment scoped parameter store variables"
      + id          = (known after apply)
      + name        = "bfd-test-pipeline-ro-parameter-store"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:DescribeParameters",
                          + "ssm:GetParameterHistory",
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/test/shared/*",
                          + "arn:aws:ssm:us-east-1:xxx:parameter/bfd/test/pipeline/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.stateless.module.bfd_pipeline.aws_iam_role_policy_attachment.parameter_store will be created
  + resource "aws_iam_role_policy_attachment" "parameter_store" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bfd-test-bfd_pipeline-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.
		
The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.
```

Note that this was run targeted to avoid an actual deployment.